artillery-load-test.yml
# npm install -g artillery@latest
# FLOWISE_LOAD_TARGET=http://localhost:3000 FLOWISE_CHATFLOW_ID=<chatflow-id> artillery run artillery-load-test.yml

config:
    target: "{{ $processEnvironment.FLOWISE_LOAD_TARGET }}"
    phases:
        - duration: 30
          arrivalRate: 1
          rampTo: 5
          name: warmup
        - duration: 60
          arrivalRate: 5
          rampTo: 20
          name: ramp
        - duration: 120
          arrivalRate: 20
          name: sustained
    defaults:
        headers:
            Content-Type: application/json
scenarios:
    - name: readiness
      weight: 1
      flow:
          - get:
                url: '/api/v1/readyz'
    - name: prediction
      weight: 4
      flow:
          - post:
                url: '/api/v1/prediction/{{ $processEnvironment.FLOWISE_CHATFLOW_ID }}'
                json:
                    question: '{{ $processEnvironment.FLOWISE_LOAD_QUESTION }}'